robertlipe/svdtoheaders/demo/h/ch32v003_reg.h

/* PWR - Power control */
#define CH32V003_PWR_BASE                 0x40007000
#define CH32V003_PWR_CTLR_OFFSET          0x0000
#define CH32V003_PWR_CTLR                 (CH32V003_PWR_BASE + CH32V003_PWR_CTLR_OFFSET) /* read-write */
#define CH32V003_PWR_CTLR_PDDS            (1 <<  1) /* 00000002: Power Down Deep Sleep */
#define CH32V003_PWR_CTLR_PVDE            (1 <<  4) /* 00000010: Power Voltage Detector Enable */
#define CH32V003_PWR_CTLR_PLS             (0x7 << 5) /* 000000e0: PVD Level Selection */
#define CH32V003_PWR_CTLR_PLS_MASK        (0x7 << 5)
#define CH32V003_PWR_CSR_OFFSET           0x0004
#define CH32V003_PWR_CSR                  (CH32V003_PWR_BASE + CH32V003_PWR_CSR_OFFSET)
#define CH32V003_PWR_CSR_PVDO             (1 <<  2) /* 00000004: PVD Output */
#define CH32V003_PWR_AWUCSR_OFFSET        0x0008
#define CH32V003_PWR_AWUCSR               (CH32V003_PWR_BASE + CH32V003_PWR_AWUCSR_OFFSET)
#define CH32V003_PWR_AWUCSR_AWUEN         (1 <<  1) /* 00000002: Automatic wake-up enable */
#define CH32V003_PWR_AWUAPR_OFFSET        0x000c
#define CH32V003_PWR_AWUAPR               (CH32V003_PWR_BASE + CH32V003_PWR_AWUAPR_OFFSET)
#define CH32V003_PWR_AWUAPR_AWUAPR        (0x3f << 0) /* 0000003f: AWU window value */
#define CH32V003_PWR_AWUAPR_AWUAPR_MASK   (0x3f << 0)
#define CH32V003_PWR_AWUPSC_OFFSET        0x0010
#define CH32V003_PWR_AWUPSC               (CH32V003_PWR_BASE + CH32V003_PWR_AWUPSC_OFFSET)
#define CH32V003_PWR_AWUPSC_AWUPSC        (0xf << 0) /* 0000000f: Wake-up prescaler */
#define CH32V003_PWR_AWUPSC_AWUPSC_MASK   (0xf << 0)

/* RCC - Reset and clock control */
#define CH32V003_RCC_BASE                 0x40021000
#define CH32V003_RCC_CTLR_OFFSET          0x0000
#define CH32V003_RCC_CTLR                 (CH32V003_RCC_BASE + CH32V003_RCC_CTLR_OFFSET)
#define CH32V003_RCC_CTLR_HSION           (1 <<  0) /* 00000001: Internal High Speed clock enable */
#define CH32V003_RCC_CTLR_HSIRDY          (1 <<  1) /* 00000002: Internal High Speed clock ready flag */
#define CH32V003_RCC_CTLR_HSITRIM         (0x1f << 3) /* 000000f8: Internal High Speed clock trimming */
#define CH32V003_RCC_CTLR_HSITRIM_MASK    (0x1f << 3)
#define CH32V003_RCC_CTLR_HSICAL          (0xff << 8) /* 0000ff00: Internal High Speed clock Calibration */
#define CH32V003_RCC_CTLR_HSICAL_MASK     (0xff << 8)
#define CH32V003_RCC_CTLR_HSEON           (1 << 16) /* 00010000: External High Speed clock enable */
#define CH32V003_RCC_CTLR_HSERDY          (1 << 17) /* 00020000: External High Speed clock ready flag */
#define CH32V003_RCC_CTLR_HSEBYP          (1 << 18) /* 00040000: External High Speed clock Bypass */
#define CH32V003_RCC_CTLR_CSSON           (1 << 19) /* 00080000: Clock Security System enable */
#define CH32V003_RCC_CTLR_PLLON           (1 << 24) /* 01000000: PLL enable */
#define CH32V003_RCC_CTLR_PLLRDY          (1 << 25) /* 02000000: PLL clock ready flag */
#define CH32V003_RCC_CFGR0_OFFSET         0x0004
#define CH32V003_RCC_CFGR0                (CH32V003_RCC_BASE + CH32V003_RCC_CFGR0_OFFSET)
#define CH32V003_RCC_CFGR0_SW             (0x3 << 0) /* 00000003: System clock Switch */
#define CH32V003_RCC_CFGR0_SW_MASK        (0x3 << 0)
#define CH32V003_RCC_CFGR0_SWS            (0x3 << 2) /* 0000000c: System Clock Switch Status */
#define CH32V003_RCC_CFGR0_SWS_MASK       (0x3 << 2)
#define CH32V003_RCC_CFGR0_HPRE           (0xf << 4) /* 000000f0: AHB prescaler */
#define CH32V003_RCC_CFGR0_HPRE_MASK      (0xf << 4)
#define CH32V003_RCC_CFGR0_PPRE1          (0x7 << 8) /* 00000700: APB Low speed prescaler (APB1) */
#define CH32V003_RCC_CFGR0_PPRE1_MASK     (0x7 << 8)
#define CH32V003_RCC_CFGR0_PPRE2          (0x7 << 11) /* 00003800: APB High speed prescaler (APB2) */
#define CH32V003_RCC_CFGR0_PPRE2_MASK     (0x7 << 11)
#define CH32V003_RCC_CFGR0_ADCPRE         (0x3 << 14) /* 0000c000: ADC prescaler */
#define CH32V003_RCC_CFGR0_ADCPRE_MASK    (0x3 << 14)
#define CH32V003_RCC_CFGR0_PLLSRC         (1 << 16) /* 00010000: PLL entry clock source */
#define CH32V003_RCC_CFGR0_MCO            (0x7 << 24) /* 07000000: Microcontroller clock output */
#define CH32V003_RCC_CFGR0_MCO_MASK       (0x7 << 24)
#define CH32V003_RCC_INTR_OFFSET          0x0008
#define CH32V003_RCC_INTR                 (CH32V003_RCC_BASE + CH32V003_RCC_INTR_OFFSET)
#define CH32V003_RCC_INTR_LSIRDYF         (1 <<  0) /* 00000001: LSI Ready Interrupt flag */
#define CH32V003_RCC_INTR_HSIRDYF         (1 <<  2) /* 00000004: HSI Ready Interrupt flag */
#define CH32V003_RCC_INTR_HSERDYF         (1 <<  3) /* 00000008: HSE Ready Interrupt flag */
#define CH32V003_RCC_INTR_PLLRDYF         (1 <<  4) /* 00000010: PLL Ready Interrupt flag */
#define CH32V003_RCC_INTR_CSSF            (1 <<  7) /* 00000080: Clock Security System Interrupt flag */
#define CH32V003_RCC_INTR_LSIRDYIE        (1 <<  8) /* 00000100: LSI Ready Interrupt Enable */
#define CH32V003_RCC_INTR_HSIRDYIE        (1 << 10) /* 00000400: HSI Ready Interrupt Enable */
#define CH32V003_RCC_INTR_HSERDYIE        (1 << 11) /* 00000800: HSE Ready Interrupt Enable */
#define CH32V003_RCC_INTR_PLLRDYIE        (1 << 12) /* 00001000: PLL Ready Interrupt Enable */
#define CH32V003_RCC_INTR_LSIRDYC         (1 << 16) /* 00010000: LSI Ready Interrupt Clear */
#define CH32V003_RCC_INTR_HSIRDYC         (1 << 18) /* 00040000: HSI Ready Interrupt Clear */
#define CH32V003_RCC_INTR_HSERDYC         (1 << 19) /* 00080000: HSE Ready Interrupt Clear */
#define CH32V003_RCC_INTR_PLLRDYC         (1 << 20) /* 00100000: PLL Ready Interrupt Clear */
#define CH32V003_RCC_INTR_CSSC            (1 << 23) /* 00800000: Clock security system interrupt clear */
#define CH32V003_RCC_APB2PRSTR_OFFSET     0x000c
#define CH32V003_RCC_APB2PRSTR            (CH32V003_RCC_BASE + CH32V003_RCC_APB2PRSTR_OFFSET) /* read-write */
#define CH32V003_RCC_APB2PRSTR_AFIORST    (1 <<  0) /* 00000001: Alternate function I/O reset */
#define CH32V003_RCC_APB2PRSTR_IOPARST    (1 <<  2) /* 00000004: IO port A reset */
#define CH32V003_RCC_APB2PRSTR_IOPCRST    (1 <<  4) /* 00000010: IO port C reset */
#define CH32V003_RCC_APB2PRSTR_IOPDRST    (1 <<  5) /* 00000020: IO port D reset */
#define CH32V003_RCC_APB2PRSTR_ADC1RST    (1 <<  9) /* 00000200: ADC 1 interface reset */
#define CH32V003_RCC_APB2PRSTR_TIM1RST    (1 << 11) /* 00000800: TIM1 timer reset */
#define CH32V003_RCC_APB2PRSTR_SPI1RST    (1 << 12) /* 00001000: SPI 1 reset */
#define CH32V003_RCC_APB2PRSTR_USART1RST  (1 << 14) /* 00004000: USART1 reset */
#define CH32V003_RCC_APB1PRSTR_OFFSET     0x0010
#define CH32V003_RCC_APB1PRSTR            (CH32V003_RCC_BASE + CH32V003_RCC_APB1PRSTR_OFFSET) /* read-write */
#define CH32V003_RCC_APB1PRSTR_WWDGRST    (1 << 11) /* 00000800: Window watchdog reset */
#define CH32V003_RCC_APB1PRSTR_I2C1RST    (1 << 21) /* 00200000: I2C1 reset */
#define CH32V003_RCC_APB1PRSTR_PWRRST     (1 << 28) /* 10000000: Power interface reset */
#define CH32V003_RCC_AHBPCENR_OFFSET      0x0014
#define CH32V003_RCC_AHBPCENR             (CH32V003_RCC_BASE + CH32V003_RCC_AHBPCENR_OFFSET) /* read-write */
#define CH32V003_RCC_AHBPCENR_DMA1EN      (1 <<  0) /* 00000001: DMA clock enable */
#define CH32V003_RCC_AHBPCENR_SRAMEN      (1 <<  2) /* 00000004: SRAM interface clock enable */
#define CH32V003_RCC_APB2PCENR_OFFSET     0x0018
#define CH32V003_RCC_APB2PCENR            (CH32V003_RCC_BASE + CH32V003_RCC_APB2PCENR_OFFSET) /* read-write */
#define CH32V003_RCC_APB2PCENR_AFIOEN     (1 <<  0) /* 00000001: Alternate function I/O clock enable */
#define CH32V003_RCC_APB2PCENR_IOPAEN     (1 <<  2) /* 00000004: I/O port A clock enable */
#define CH32V003_RCC_APB2PCENR_IOPCEN     (1 <<  4) /* 00000010: I/O port C clock enable */
#define CH32V003_RCC_APB2PCENR_IOPDEN     (1 <<  5) /* 00000020: I/O port D clock enable */
#define CH32V003_RCC_APB2PCENR_ADC1EN     (1 <<  9) /* 00000200: ADC1 interface clock enable */
#define CH32V003_RCC_APB2PCENR_TIM1EN     (1 << 11) /* 00000800: TIM1 Timer clock enable */
#define CH32V003_RCC_APB2PCENR_SPI1EN     (1 << 12) /* 00001000: SPI 1 clock enable */
#define CH32V003_RCC_APB2PCENR_USART1EN   (1 << 14) /* 00004000: USART1 clock enable */
#define CH32V003_RCC_APB1PCENR_OFFSET     0x001c
#define CH32V003_RCC_APB1PCENR            (CH32V003_RCC_BASE + CH32V003_RCC_APB1PCENR_OFFSET) /* read-write */
#define CH32V003_RCC_APB1PCENR_TIM2EN     (1 <<  0) /* 00000001: Timer 2 clock enable */
#define CH32V003_RCC_APB1PCENR_WWDGEN     (1 << 11) /* 00000800: Window watchdog clock enable */
#define CH32V003_RCC_APB1PCENR_I2C1EN     (1 << 21) /* 00200000: I2C 1 clock enable */
#define CH32V003_RCC_APB1PCENR_PWREN      (1 << 28) /* 10000000: Power interface clock enable */
#define CH32V003_RCC_RSTSCKR_OFFSET       0x0024
#define CH32V003_RCC_RSTSCKR              (CH32V003_RCC_BASE + CH32V003_RCC_RSTSCKR_OFFSET)
#define CH32V003_RCC_RSTSCKR_LSION        (1 <<  0) /* 00000001: Internal low speed oscillator enable */
#define CH32V003_RCC_RSTSCKR_LSIRDY       (1 <<  1) /* 00000002: Internal low speed oscillator ready */
#define CH32V003_RCC_RSTSCKR_RMVF         (1 << 24) /* 01000000: Remove reset flag */
#define CH32V003_RCC_RSTSCKR_PINRSTF      (1 << 26) /* 04000000: PIN reset flag */
#define CH32V003_RCC_RSTSCKR_PORRSTF      (1 << 27) /* 08000000: POR/PDR reset flag */
#define CH32V003_RCC_RSTSCKR_SFTRSTF      (1 << 28) /* 10000000: Software reset flag */
#define CH32V003_RCC_RSTSCKR_IWDGRSTF     (1 << 29) /* 20000000: Independent watchdog reset flag */
#define CH32V003_RCC_RSTSCKR_WWDGRSTF     (1 << 30) /* 40000000: Window watchdog reset flag */
#define CH32V003_RCC_RSTSCKR_LPWRRSTF     (1 << 31) /* 80000000: Low-power reset flag */

/* EXTEND - Extend configuration */
#define CH32V003_EXTEND_BASE              0x40023800
#define CH32V003_EXTEND_EXTEND_CTR_OFFSET 0x0000
#define CH32V003_EXTEND_EXTEND_CTR        (CH32V003_EXTEND_BASE + CH32V003_EXTEND_EXTEND_CTR_OFFSET)
#define CH32V003_EXTEND_EXTEND_CTR_PLL_CFG (0xf << 0) /* 0000000f: Configure the PLL clock delay time */
#define CH32V003_EXTEND_EXTEND_CTR_PLL_CFG_MASK (0xf << 0)
#define CH32V003_EXTEND_EXTEND_CTR_LOCKUP_EN (1 <<  6) /* 00000040: LOCKUP_Enable */
#define CH32V003_EXTEND_EXTEND_CTR_LOCKUP_RESET (1 <<  7) /* 00000080: LOCKUP RESET */
#define CH32V003_EXTEND_EXTEND_CTR_LDO_TRIM (1 << 10) /* 00000400: LDO_TRIM */
#define CH32V003_EXTEND_EXTEND_CTR_FLASH_CLK_TRIM (0x7 << 11) /* 00003800: FLASH clock trimming */
#define CH32V003_EXTEND_EXTEND_CTR_FLASH_CLK_TRIM_MASK (0x7 << 11)
#define CH32V003_EXTEND_EXTEND_CTR_WR_EN  (1 << 14) /* 00004000: Control Register write enable */
#define CH32V003_EXTEND_EXTEND_CTR_WR_LOCK (1 << 15) /* 00008000: Control Register write lock */
#define CH32V003_EXTEND_EXTEND_CTR_OPA_EN (1 << 16) /* 00010000: OPA Enalbe */
#define CH32V003_EXTEND_EXTEND_CTR_OPA_NSEL (1 << 17) /* 00020000: OPA negative end channel selection */
#define CH32V003_EXTEND_EXTEND_CTR_OPA_PSEL (1 << 18) /* 00040000: OPA positive end channel selection */
#define CH32V003_EXTEND_EXTEND_KR_OFFSET  0x0004
#define CH32V003_EXTEND_EXTEND_KR         (CH32V003_EXTEND_BASE + CH32V003_EXTEND_EXTEND_KR_OFFSET)
#define CH32V003_EXTEND_EXTEND_KR_KEY     (0xffffffff << 0) /* ffffffff: Write key value */
#define CH32V003_EXTEND_EXTEND_KR_KEY_MASK (0xffffffff << 0)

/* GPIOA - General purpose I/O */
#define CH32V003_GPIOA_BASE               0x40010800
#define CH32V003_GPIOA_CFGLR_OFFSET       0x0000
#define CH32V003_GPIOA_CFGLR              (CH32V003_GPIOA_BASE + CH32V003_GPIOA_CFGLR_OFFSET) /* read-write */
#define CH32V003_GPIOA_CFGLR_MODE0        (0x3 << 0) /* 00000003: Port n.0 mode bits */
#define CH32V003_GPIOA_CFGLR_MODE0_MASK   (0x3 << 0)
#define CH32V003_GPIOA_CFGLR_CNF0         (0x3 << 2) /* 0000000c: Port n.0 configuration bits */
#define CH32V003_GPIOA_CFGLR_CNF0_MASK    (0x3 << 2)
#define CH32V003_GPIOA_CFGLR_MODE1        (0x3 << 4) /* 00000030: Port n.1 mode bits */
#define CH32V003_GPIOA_CFGLR_MODE1_MASK   (0x3 << 4)
#define CH32V003_GPIOA_CFGLR_CNF1         (0x3 << 6) /* 000000c0: Port n.1 configuration bits */
#define CH32V003_GPIOA_CFGLR_CNF1_MASK    (0x3 << 6)
#define CH32V003_GPIOA_CFGLR_MODE2        (0x3 << 8) /* 00000300: Port n.2 mode bits */
#define CH32V003_GPIOA_CFGLR_MODE2_MASK   (0x3 << 8)
#define CH32V003_GPIOA_CFGLR_CNF2         (0x3 << 10) /* 00000c00: Port n.2 configuration bits */
#define CH32V003_GPIOA_CFGLR_CNF2_MASK    (0x3 << 10)
#define CH32V003_GPIOA_CFGLR_MODE3        (0x3 << 12) /* 00003000: Port n.3 mode bits */
#define CH32V003_GPIOA_CFGLR_MODE3_MASK   (0x3 << 12)
#define CH32V003_GPIOA_CFGLR_CNF3         (0x3 << 14) /* 0000c000: Port n.3 configuration bits */
#define CH32V003_GPIOA_CFGLR_CNF3_MASK    (0x3 << 14)
#define CH32V003_GPIOA_CFGLR_MODE4        (0x3 << 16) /* 00030000: Port n.4 mode bits */
#define CH32V003_GPIOA_CFGLR_MODE4_MASK   (0x3 << 16)
#define CH32V003_GPIOA_CFGLR_CNF4         (0x3 << 18) /* 000c0000: Port n.4 configuration bits */
#define CH32V003_GPIOA_CFGLR_CNF4_MASK    (0x3 << 18)
#define CH32V003_GPIOA_CFGLR_MODE5        (0x3 << 20) /* 00300000: Port n.5 mode bits */
#define CH32V003_GPIOA_CFGLR_MODE5_MASK   (0x3 << 20)
#define CH32V003_GPIOA_CFGLR_CNF5         (0x3 << 22) /* 00c00000: Port n.5 configuration bits */
#define CH32V003_GPIOA_CFGLR_CNF5_MASK    (0x3 << 22)
#define CH32V003_GPIOA_CFGLR_MODE6        (0x3 << 24) /* 03000000: Port n.6 mode bits */
#define CH32V003_GPIOA_CFGLR_MODE6_MASK   (0x3 << 24)
#define CH32V003_GPIOA_CFGLR_CNF6         (0x3 << 26) /* 0c000000: Port n.6 configuration bits */
#define CH32V003_GPIOA_CFGLR_CNF6_MASK    (0x3 << 26)
#define CH32V003_GPIOA_CFGLR_MODE7        (0x3 << 28) /* 30000000: Port n.7 mode bits */
#define CH32V003_GPIOA_CFGLR_MODE7_MASK   (0x3 << 28)
#define CH32V003_GPIOA_CFGLR_CNF7         (0x3 << 30) /* c0000000: Port n.7 configuration bits */
#define CH32V003_GPIOA_CFGLR_CNF7_MASK    (0x3 << 30)
#define CH32V003_GPIOA_INDR_OFFSET        0x0008
#define CH32V003_GPIOA_INDR               (CH32V003_GPIOA_BASE + CH32V003_GPIOA_INDR_OFFSET) /* read-only */
#define CH32V003_GPIOA_INDR_IDR0          (1 <<  0) /* 00000001: Port input data */
#define CH32V003_GPIOA_INDR_IDR1          (1 <<  1) /* 00000002: Port input data */
#define CH32V003_GPIOA_INDR_IDR2          (1 <<  2) /* 00000004: Port input data */
#define CH32V003_GPIOA_INDR_IDR3          (1 <<  3) /* 00000008: Port input data */
#define CH32V003_GPIOA_INDR_IDR4          (1 <<  4) /* 00000010: Port input data */
#define CH32V003_GPIOA_INDR_IDR5          (1 <<  5) /* 00000020: Port input data */
#define CH32V003_GPIOA_INDR_IDR6          (1 <<  6) /* 00000040: Port input data */
#define CH32V003_GPIOA_INDR_IDR7          (1 <<  7) /* 00000080: Port input data */
#define CH32V003_GPIOA_OUTDR_OFFSET       0x000c
#define CH32V003_GPIOA_OUTDR              (CH32V003_GPIOA_BASE + CH32V003_GPIOA_OUTDR_OFFSET) /* read-write */
#define CH32V003_GPIOA_OUTDR_ODR0         (1 <<  0) /* 00000001: Port output data */
#define CH32V003_GPIOA_OUTDR_ODR1         (1 <<  1) /* 00000002: Port output data */
#define CH32V003_GPIOA_OUTDR_ODR2         (1 <<  2) /* 00000004: Port output data */
#define CH32V003_GPIOA_OUTDR_ODR3         (1 <<  3) /* 00000008: Port output data */
#define CH32V003_GPIOA_OUTDR_ODR4         (1 <<  4) /* 00000010: Port output data */
#define CH32V003_GPIOA_OUTDR_ODR5         (1 <<  5) /* 00000020: Port output data */
#define CH32V003_GPIOA_OUTDR_ODR6         (1 <<  6) /* 00000040: Port output data */
#define CH32V003_GPIOA_OUTDR_ODR7         (1 <<  7) /* 00000080: Port output data */
#define CH32V003_GPIOA_BSHR_OFFSET        0x0010
#define CH32V003_GPIOA_BSHR               (CH32V003_GPIOA_BASE + CH32V003_GPIOA_BSHR_OFFSET) /* write-only */
#define CH32V003_GPIOA_BSHR_BS0           (1 <<  0) /* 00000001: Set bit 0 */
#define CH32V003_GPIOA_BSHR_BS1           (1 <<  1) /* 00000002: Set bit 1 */
#define CH32V003_GPIOA_BSHR_BS2           (1 <<  2) /* 00000004: Set bit 1 */
#define CH32V003_GPIOA_BSHR_BS3           (1 <<  3) /* 00000008: Set bit 3 */
#define CH32V003_GPIOA_BSHR_BS4           (1 <<  4) /* 00000010: Set bit 4 */
#define CH32V003_GPIOA_BSHR_BS5           (1 <<  5) /* 00000020: Set bit 5 */
#define CH32V003_GPIOA_BSHR_BS6           (1 <<  6) /* 00000040: Set bit 6 */
#define CH32V003_GPIOA_BSHR_BS7           (1 <<  7) /* 00000080: Set bit 7 */
#define CH32V003_GPIOA_BSHR_BR0           (1 << 16) /* 00010000: Reset bit 0 */
#define CH32V003_GPIOA_BSHR_BR1           (1 << 17) /* 00020000: Reset bit 1 */
#define CH32V003_GPIOA_BSHR_BR2           (1 << 18) /* 00040000: Reset bit 2 */
#define CH32V003_GPIOA_BSHR_BR3           (1 << 19) /* 00080000: Reset bit 3 */
#define CH32V003_GPIOA_BSHR_BR4           (1 << 20) /* 00100000: Reset bit 4 */
#define CH32V003_GPIOA_BSHR_BR5           (1 << 21) /* 00200000: Reset bit 5 */
#define CH32V003_GPIOA_BSHR_BR6           (1 << 22) /* 00400000: Reset bit 6 */
#define CH32V003_GPIOA_BSHR_BR7           (1 << 23) /* 00800000: Reset bit 7 */
#define CH32V003_GPIOA_BCR_OFFSET         0x0014
#define CH32V003_GPIOA_BCR                (CH32V003_GPIOA_BASE + CH32V003_GPIOA_BCR_OFFSET) /* write-only */
#define CH32V003_GPIOA_BCR_BR0            (1 <<  0) /* 00000001: Reset bit 0 */
#define CH32V003_GPIOA_BCR_BR1            (1 <<  1) /* 00000002: Reset bit 1 */
#define CH32V003_GPIOA_BCR_BR2            (1 <<  2) /* 00000004: Reset bit 1 */
#define CH32V003_GPIOA_BCR_BR3            (1 <<  3) /* 00000008: Reset bit 3 */
#define CH32V003_GPIOA_BCR_BR4            (1 <<  4) /* 00000010: Reset bit 4 */
#define CH32V003_GPIOA_BCR_BR5            (1 <<  5) /* 00000020: Reset bit 5 */
#define CH32V003_GPIOA_BCR_BR6            (1 <<  6) /* 00000040: Reset bit 6 */
#define CH32V003_GPIOA_BCR_BR7            (1 <<  7) /* 00000080: Reset bit 7 */
#define CH32V003_GPIOA_LCKR_OFFSET        0x0018
#define CH32V003_GPIOA_LCKR               (CH32V003_GPIOA_BASE + CH32V003_GPIOA_LCKR_OFFSET) /* read-write */
#define CH32V003_GPIOA_LCKR_LCK0          (1 <<  0) /* 00000001: Port A Lock bit 0 */
#define CH32V003_GPIOA_LCKR_LCK1          (1 <<  1) /* 00000002: Port A Lock bit 1 */
#define CH32V003_GPIOA_LCKR_LCK2          (1 <<  2) /* 00000004: Port A Lock bit 2 */
#define CH32V003_GPIOA_LCKR_LCK3          (1 <<  3) /* 00000008: Port A Lock bit 3 */
#define CH32V003_GPIOA_LCKR_LCK4          (1 <<  4) /* 00000010: Port A Lock bit 4 */
#define CH32V003_GPIOA_LCKR_LCK5          (1 <<  5) /* 00000020: Port A Lock bit 5 */
#define CH32V003_GPIOA_LCKR_LCK6          (1 <<  6) /* 00000040: Port A Lock bit 6 */
#define CH32V003_GPIOA_LCKR_LCK7          (1 <<  7) /* 00000080: Port A Lock bit 7 */
#define CH32V003_GPIOA_LCKR_LCKK          (1 <<  8) /* 00000100: Lock key */

