robertlipe/svdtoheaders/demo/h/ch32v003_reg.h
/* AFIO - Alternate function I/O */
#define CH32V003_AFIO_BASE                0x40010000
#define CH32V003_AFIO_PCFR_OFFSET         0x0004
#define CH32V003_AFIO_PCFR                (CH32V003_AFIO_BASE + CH32V003_AFIO_PCFR_OFFSET)
#define CH32V003_AFIO_PCFR_SPI1RM         (1 <<  0) /* 00000001: SPI1 remapping */
#define CH32V003_AFIO_PCFR_I2C1RM         (1 <<  1) /* 00000002: I2C1 remapping */
#define CH32V003_AFIO_PCFR_USART1RM       (1 <<  2) /* 00000004: USART1 remapping */
#define CH32V003_AFIO_PCFR_TIM1RM         (0x3 << 6) /* 000000c0: TIM1 remapping */
#define CH32V003_AFIO_PCFR_TIM1RM_MASK    (0x3 << 6)
#define CH32V003_AFIO_PCFR_TIM2RM         (0x3 << 8) /* 00000300: TIM2 remapping */
#define CH32V003_AFIO_PCFR_TIM2RM_MASK    (0x3 << 8)
#define CH32V003_AFIO_PCFR_PA12RM         (1 << 15) /* 00008000: Port A1/Port A2 mapping on OSCIN/OSCOUT */
#define CH32V003_AFIO_PCFR_ADC1_ETRGINJ_RM (1 << 17) /* 00020000: ADC 1 External trigger injected conversion remapping */
#define CH32V003_AFIO_PCFR_ADC1_ETRGREG_RM (1 << 18) /* 00040000: ADC 1 external trigger regular conversion remapping */
#define CH32V003_AFIO_PCFR_USART1REMAP1   (1 << 21) /* 00200000: USART1 remapping */
#define CH32V003_AFIO_PCFR_I2C1REMAP1     (1 << 22) /* 00400000: I2C1 remapping */
#define CH32V003_AFIO_PCFR_TIM1_IREMAP    (1 << 23) /* 00800000: TIM1_CH1 channel selection */
#define CH32V003_AFIO_PCFR_SWCFG          (0x7 << 24) /* 07000000: Serial wire JTAG configuration */
#define CH32V003_AFIO_PCFR_SWCFG_MASK     (0x7 << 24)
#define CH32V003_AFIO_EXTICR_OFFSET       0x0008
#define CH32V003_AFIO_EXTICR              (CH32V003_AFIO_BASE + CH32V003_AFIO_EXTICR_OFFSET) /* read-write */
#define CH32V003_AFIO_EXTICR_EXTI0        (0x3 << 0) /* 00000003: EXTI0 configuration */
#define CH32V003_AFIO_EXTICR_EXTI0_MASK   (0x3 << 0)
#define CH32V003_AFIO_EXTICR_EXTI1        (0x3 << 2) /* 0000000c: EXTI1 configuration */
#define CH32V003_AFIO_EXTICR_EXTI1_MASK   (0x3 << 2)
#define CH32V003_AFIO_EXTICR_EXTI2        (0x3 << 4) /* 00000030: EXTI2 configuration */
#define CH32V003_AFIO_EXTICR_EXTI2_MASK   (0x3 << 4)
#define CH32V003_AFIO_EXTICR_EXTI3        (0x3 << 6) /* 000000c0: EXTI3 configuration */
#define CH32V003_AFIO_EXTICR_EXTI3_MASK   (0x3 << 6)
#define CH32V003_AFIO_EXTICR_EXTI4        (0x3 << 8) /* 00000300: EXTI4 configuration */
#define CH32V003_AFIO_EXTICR_EXTI4_MASK   (0x3 << 8)
#define CH32V003_AFIO_EXTICR_EXTI5        (0x3 << 10) /* 00000c00: EXTI5 configuration */
#define CH32V003_AFIO_EXTICR_EXTI5_MASK   (0x3 << 10)
#define CH32V003_AFIO_EXTICR_EXTI6        (0x3 << 12) /* 00003000: EXTI6 configuration */
#define CH32V003_AFIO_EXTICR_EXTI6_MASK   (0x3 << 12)
#define CH32V003_AFIO_EXTICR_EXTI7        (0x3 << 14) /* 0000c000: EXTI7 configuration */
#define CH32V003_AFIO_EXTICR_EXTI7_MASK   (0x3 << 14)

/* EXTI - EXTI */
#define CH32V003_EXTI_BASE                0x40010400
#define CH32V003_EXTI_INTENR_OFFSET       0x0000
#define CH32V003_EXTI_INTENR              (CH32V003_EXTI_BASE + CH32V003_EXTI_INTENR_OFFSET) /* read-write */
#define CH32V003_EXTI_INTENR_MR0          (1 <<  0) /* 00000001: Interrupt Mask on line 0 */
#define CH32V003_EXTI_INTENR_MR1          (1 <<  1) /* 00000002: Interrupt Mask on line 1 */
#define CH32V003_EXTI_INTENR_MR2          (1 <<  2) /* 00000004: Interrupt Mask on line 2 */
#define CH32V003_EXTI_INTENR_MR3          (1 <<  3) /* 00000008: Interrupt Mask on line 3 */
#define CH32V003_EXTI_INTENR_MR4          (1 <<  4) /* 00000010: Interrupt Mask on line 4 */
#define CH32V003_EXTI_INTENR_MR5          (1 <<  5) /* 00000020: Interrupt Mask on line 5 */
#define CH32V003_EXTI_INTENR_MR6          (1 <<  6) /* 00000040: Interrupt Mask on line 6 */
#define CH32V003_EXTI_INTENR_MR7          (1 <<  7) /* 00000080: Interrupt Mask on line 7 */
#define CH32V003_EXTI_INTENR_MR8          (1 <<  8) /* 00000100: Interrupt Mask on line 8 */
#define CH32V003_EXTI_INTENR_MR9          (1 <<  9) /* 00000200: Interrupt Mask on line 9 */
#define CH32V003_EXTI_EVENR_OFFSET        0x0004
#define CH32V003_EXTI_EVENR               (CH32V003_EXTI_BASE + CH32V003_EXTI_EVENR_OFFSET) /* read-write */
#define CH32V003_EXTI_EVENR_MR0           (1 <<  0) /* 00000001: Event Mask on line 0 */
#define CH32V003_EXTI_EVENR_MR1           (1 <<  1) /* 00000002: Event Mask on line 1 */
#define CH32V003_EXTI_EVENR_MR2           (1 <<  2) /* 00000004: Event Mask on line 2 */
#define CH32V003_EXTI_EVENR_MR3           (1 <<  3) /* 00000008: Event Mask on line 3 */
#define CH32V003_EXTI_EVENR_MR4           (1 <<  4) /* 00000010: Event Mask on line 4 */
#define CH32V003_EXTI_EVENR_MR5           (1 <<  5) /* 00000020: Event Mask on line 5 */
#define CH32V003_EXTI_EVENR_MR6           (1 <<  6) /* 00000040: Event Mask on line 6 */
#define CH32V003_EXTI_EVENR_MR7           (1 <<  7) /* 00000080: Event Mask on line 7 */
#define CH32V003_EXTI_EVENR_MR8           (1 <<  8) /* 00000100: Event Mask on line 8 */
#define CH32V003_EXTI_EVENR_MR9           (1 <<  9) /* 00000200: Event Mask on line 9 */
#define CH32V003_EXTI_RTENR_OFFSET        0x0008
#define CH32V003_EXTI_RTENR               (CH32V003_EXTI_BASE + CH32V003_EXTI_RTENR_OFFSET) /* read-write */
#define CH32V003_EXTI_RTENR_TR0           (1 <<  0) /* 00000001: Rising trigger event configuration of line 0 */
#define CH32V003_EXTI_RTENR_TR1           (1 <<  1) /* 00000002: Rising trigger event configuration of line 1 */
#define CH32V003_EXTI_RTENR_TR2           (1 <<  2) /* 00000004: Rising trigger event configuration of line 2 */
#define CH32V003_EXTI_RTENR_TR3           (1 <<  3) /* 00000008: Rising trigger event configuration of line 3 */
#define CH32V003_EXTI_RTENR_TR4           (1 <<  4) /* 00000010: Rising trigger event configuration of line 4 */
#define CH32V003_EXTI_RTENR_TR5           (1 <<  5) /* 00000020: Rising trigger event configuration of line 5 */
#define CH32V003_EXTI_RTENR_TR6           (1 <<  6) /* 00000040: Rising trigger event configuration of line 6 */
#define CH32V003_EXTI_RTENR_TR7           (1 <<  7) /* 00000080: Rising trigger event configuration of line 7 */
#define CH32V003_EXTI_RTENR_TR8           (1 <<  8) /* 00000100: Rising trigger event configuration of line 8 */
#define CH32V003_EXTI_RTENR_TR9           (1 <<  9) /* 00000200: Rising trigger event configuration of line 9 */
#define CH32V003_EXTI_FTENR_OFFSET        0x000c
#define CH32V003_EXTI_FTENR               (CH32V003_EXTI_BASE + CH32V003_EXTI_FTENR_OFFSET) /* read-write */
#define CH32V003_EXTI_FTENR_TR0           (1 <<  0) /* 00000001: Falling trigger event configuration of line 0 */
#define CH32V003_EXTI_FTENR_TR1           (1 <<  1) /* 00000002: Falling trigger event configuration of line 1 */
#define CH32V003_EXTI_FTENR_TR2           (1 <<  2) /* 00000004: Falling trigger event configuration of line 2 */
#define CH32V003_EXTI_FTENR_TR3           (1 <<  3) /* 00000008: Falling trigger event configuration of line 3 */
#define CH32V003_EXTI_FTENR_TR4           (1 <<  4) /* 00000010: Falling trigger event configuration of line 4 */
#define CH32V003_EXTI_FTENR_TR5           (1 <<  5) /* 00000020: Falling trigger event configuration of line 5 */
#define CH32V003_EXTI_FTENR_TR6           (1 <<  6) /* 00000040: Falling trigger event configuration of line 6 */
#define CH32V003_EXTI_FTENR_TR7           (1 <<  7) /* 00000080: Falling trigger event configuration of line 7 */
#define CH32V003_EXTI_FTENR_TR8           (1 <<  8) /* 00000100: Falling trigger event configuration of line 8 */
#define CH32V003_EXTI_FTENR_TR9           (1 <<  9) /* 00000200: Falling trigger event configuration of line 9 */
#define CH32V003_EXTI_SWIEVR_OFFSET       0x0010
#define CH32V003_EXTI_SWIEVR              (CH32V003_EXTI_BASE + CH32V003_EXTI_SWIEVR_OFFSET) /* read-write */
#define CH32V003_EXTI_SWIEVR_SWIER0       (1 <<  0) /* 00000001: Software Interrupt on line 0 */
#define CH32V003_EXTI_SWIEVR_SWIER1       (1 <<  1) /* 00000002: Software Interrupt on line 1 */
#define CH32V003_EXTI_SWIEVR_SWIER2       (1 <<  2) /* 00000004: Software Interrupt on line 2 */
#define CH32V003_EXTI_SWIEVR_SWIER3       (1 <<  3) /* 00000008: Software Interrupt on line 3 */
#define CH32V003_EXTI_SWIEVR_SWIER4       (1 <<  4) /* 00000010: Software Interrupt on line 4 */
#define CH32V003_EXTI_SWIEVR_SWIER5       (1 <<  5) /* 00000020: Software Interrupt on line 5 */
#define CH32V003_EXTI_SWIEVR_SWIER6       (1 <<  6) /* 00000040: Software Interrupt on line 6 */
#define CH32V003_EXTI_SWIEVR_SWIER7       (1 <<  7) /* 00000080: Software Interrupt on line 7 */
#define CH32V003_EXTI_SWIEVR_SWIER8       (1 <<  8) /* 00000100: Software Interrupt on line 8 */
#define CH32V003_EXTI_SWIEVR_SWIER9       (1 <<  9) /* 00000200: Software Interrupt on line 9 */
#define CH32V003_EXTI_INTFR_OFFSET        0x0014
#define CH32V003_EXTI_INTFR               (CH32V003_EXTI_BASE + CH32V003_EXTI_INTFR_OFFSET) /* read-write */
#define CH32V003_EXTI_INTFR_PR0           (1 <<  0) /* 00000001: Pending bit 0 */
#define CH32V003_EXTI_INTFR_PR1           (1 <<  1) /* 00000002: Pending bit 1 */
#define CH32V003_EXTI_INTFR_PR2           (1 <<  2) /* 00000004: Pending bit 2 */
#define CH32V003_EXTI_INTFR_PR3           (1 <<  3) /* 00000008: Pending bit 3 */
#define CH32V003_EXTI_INTFR_PR4           (1 <<  4) /* 00000010: Pending bit 4 */
#define CH32V003_EXTI_INTFR_PR5           (1 <<  5) /* 00000020: Pending bit 5 */
#define CH32V003_EXTI_INTFR_PR6           (1 <<  6) /* 00000040: Pending bit 6 */
#define CH32V003_EXTI_INTFR_PR7           (1 <<  7) /* 00000080: Pending bit 7 */
#define CH32V003_EXTI_INTFR_PR8           (1 <<  8) /* 00000100: Pending bit 8 */
#define CH32V003_EXTI_INTFR_PR9           (1 <<  9) /* 00000200: Pending bit 9 */

