robertlipe/svdtoheaders/demo/h/ch32v003_reg.h
/* ESIG - Device electronic signature */
#define CH32V003_ESIG_BASE                0x1ffff7e0
#define CH32V003_ESIG_FLACAP_OFFSET       0x0000
#define CH32V003_ESIG_FLACAP              (CH32V003_ESIG_BASE + CH32V003_ESIG_FLACAP_OFFSET) /* read-only */
#define CH32V003_ESIG_FLACAP_FLASHSIZE    (0xffff << 0) /* 0000ffff: Flash size */
#define CH32V003_ESIG_FLACAP_FLASHSIZE_MASK (0xffff << 0)
#define CH32V003_ESIG_UNIID1_OFFSET       0x0008
#define CH32V003_ESIG_UNIID1              (CH32V003_ESIG_BASE + CH32V003_ESIG_UNIID1_OFFSET) /* read-only */
#define CH32V003_ESIG_UNIID1_U_ID         (0xffffffff << 0) /* ffffffff: Unique identity[31:0] */
#define CH32V003_ESIG_UNIID1_U_ID_MASK    (0xffffffff << 0)
#define CH32V003_ESIG_UNIID2_OFFSET       0x000c
#define CH32V003_ESIG_UNIID2              (CH32V003_ESIG_BASE + CH32V003_ESIG_UNIID2_OFFSET) /* read-only */
#define CH32V003_ESIG_UNIID2_U_ID         (0xffffffff << 0) /* ffffffff: Unique identity[63:32] */
#define CH32V003_ESIG_UNIID2_U_ID_MASK    (0xffffffff << 0)
#define CH32V003_ESIG_UNIID3_OFFSET       0x0010
#define CH32V003_ESIG_UNIID3              (CH32V003_ESIG_BASE + CH32V003_ESIG_UNIID3_OFFSET) /* read-only */
#define CH32V003_ESIG_UNIID3_U_ID         (0xffffffff << 0) /* ffffffff: Unique identity[95:64] */
#define CH32V003_ESIG_UNIID3_U_ID_MASK    (0xffffffff << 0)

/* FLASH - FLASH */
#define CH32V003_FLASH_BASE               0x40022000
#define CH32V003_FLASH_ACTLR_OFFSET       0x0000
#define CH32V003_FLASH_ACTLR              (CH32V003_FLASH_BASE + CH32V003_FLASH_ACTLR_OFFSET)
#define CH32V003_FLASH_ACTLR_LATENCY      (1 <<  0) /* 00000001: Number of FLASH wait states */
#define CH32V003_FLASH_KEYR_OFFSET        0x0004
#define CH32V003_FLASH_KEYR               (CH32V003_FLASH_BASE + CH32V003_FLASH_KEYR_OFFSET) /* write-only */
#define CH32V003_FLASH_KEYR_KEYR          (0xffffffff << 0) /* ffffffff: FPEC key */
#define CH32V003_FLASH_KEYR_KEYR_MASK     (0xffffffff << 0)
#define CH32V003_FLASH_OBKEYR_OFFSET      0x0008
#define CH32V003_FLASH_OBKEYR             (CH32V003_FLASH_BASE + CH32V003_FLASH_OBKEYR_OFFSET) /* write-only */
#define CH32V003_FLASH_OBKEYR_OPTKEY      (0xffffffff << 0) /* ffffffff: Option byte key */
#define CH32V003_FLASH_OBKEYR_OPTKEY_MASK (0xffffffff << 0)
#define CH32V003_FLASH_STATR_OFFSET       0x000c
#define CH32V003_FLASH_STATR              (CH32V003_FLASH_BASE + CH32V003_FLASH_STATR_OFFSET)
#define CH32V003_FLASH_STATR_BOOT_LOCK    (1 << 15) /* 00008000: BOOT lock */
#define CH32V003_FLASH_STATR_BOOT_MODE    (1 << 14) /* 00004000: BOOT mode */
#define CH32V003_FLASH_STATR_EOP          (1 <<  5) /* 00000020: End of operation */
#define CH32V003_FLASH_STATR_WRPRTERR     (1 <<  4) /* 00000010: Write protection error */
#define CH32V003_FLASH_STATR_BSY          (1 <<  0) /* 00000001: Busy */
#define CH32V003_FLASH_CTLR_OFFSET        0x0010
#define CH32V003_FLASH_CTLR               (CH32V003_FLASH_BASE + CH32V003_FLASH_CTLR_OFFSET) /* read-write */
#define CH32V003_FLASH_CTLR_PG            (1 <<  0) /* 00000001: Programming */
#define CH32V003_FLASH_CTLR_PER           (1 <<  1) /* 00000002: Page Erase */
#define CH32V003_FLASH_CTLR_MER           (1 <<  2) /* 00000004: Mass Erase */
#define CH32V003_FLASH_CTLR_OBPG          (1 <<  4) /* 00000010: Option byte programming */
#define CH32V003_FLASH_CTLR_OBER          (1 <<  5) /* 00000020: Option byte erase */
#define CH32V003_FLASH_CTLR_STRT          (1 <<  6) /* 00000040: Start */
#define CH32V003_FLASH_CTLR_LOCK          (1 <<  7) /* 00000080: Lock */
#define CH32V003_FLASH_CTLR_OBWRE         (1 <<  9) /* 00000200: Option bytes write enable */
#define CH32V003_FLASH_CTLR_ERRIE         (1 << 10) /* 00000400: Error interrupt enable */
#define CH32V003_FLASH_CTLR_EOPIE         (1 << 12) /* 00001000: End of operation interrupt enable */
#define CH32V003_FLASH_CTLR_FLOCK         (1 << 15) /* 00008000: Fast programmable lock */
#define CH32V003_FLASH_CTLR_PAGE_PG       (1 << 16) /* 00010000: Fast programming */
#define CH32V003_FLASH_CTLR_PAGE_ER       (1 << 17) /* 00020000: Fast erase */
#define CH32V003_FLASH_CTLR_BUFLOAD       (1 << 18) /* 00040000: Buffer load */
#define CH32V003_FLASH_CTLR_BUFRST        (1 << 19) /* 00080000: Buffer reset */
#define CH32V003_FLASH_ADDR_OFFSET        0x0014
#define CH32V003_FLASH_ADDR               (CH32V003_FLASH_BASE + CH32V003_FLASH_ADDR_OFFSET) /* write-only */
#define CH32V003_FLASH_ADDR_ADDR          (0xffffffff << 0) /* ffffffff: Flash Address */
#define CH32V003_FLASH_ADDR_ADDR_MASK     (0xffffffff << 0)
#define CH32V003_FLASH_OBR_OFFSET         0x001c
#define CH32V003_FLASH_OBR                (CH32V003_FLASH_BASE + CH32V003_FLASH_OBR_OFFSET) /* read-only */
#define CH32V003_FLASH_OBR_OBERR          (1 <<  0) /* 00000001: Option byte error */
#define CH32V003_FLASH_OBR_RDPRT          (1 <<  1) /* 00000002: Read protection */
#define CH32V003_FLASH_OBR_IWDG_SW        (1 <<  2) /* 00000004: IWDG_SW */
#define CH32V003_FLASH_OBR_STOP_RST       (1 <<  3) /* 00000008: STOP_RST */
#define CH32V003_FLASH_OBR_STANDY_RST     (1 <<  4) /* 00000010: STANDY_RST */
#define CH32V003_FLASH_OBR_CFG_RST_MODE   (0x3 << 5) /* 00000060: CFG_RST_MODE */
#define CH32V003_FLASH_OBR_CFG_RST_MODE_MASK (0x3 << 5)
#define CH32V003_FLASH_OBR_DATA0          (0xff << 10) /* 0003fc00: DATA0 */
#define CH32V003_FLASH_OBR_DATA0_MASK     (0xff << 10)
#define CH32V003_FLASH_OBR_DATA1          (0xff << 18) /* 03fc0000: DATA1 */
#define CH32V003_FLASH_OBR_DATA1_MASK     (0xff << 18)
#define CH32V003_FLASH_WPR_OFFSET         0x0020
#define CH32V003_FLASH_WPR                (CH32V003_FLASH_BASE + CH32V003_FLASH_WPR_OFFSET) /* read-only */
#define CH32V003_FLASH_WPR_WRP            (0xffffffff << 0) /* ffffffff: Write protect */
#define CH32V003_FLASH_WPR_WRP_MASK       (0xffffffff << 0)
#define CH32V003_FLASH_MODEKEYR_OFFSET    0x0024
#define CH32V003_FLASH_MODEKEYR           (CH32V003_FLASH_BASE + CH32V003_FLASH_MODEKEYR_OFFSET) /* write-only */
#define CH32V003_FLASH_MODEKEYR_MODEKEYR  (0xffffffff << 0) /* ffffffff: Mode select */
#define CH32V003_FLASH_MODEKEYR_MODEKEYR_MASK (0xffffffff << 0)
#define CH32V003_FLASH_BOOT_MODEKEYP_OFFSET 0x0028
#define CH32V003_FLASH_BOOT_MODEKEYP      (CH32V003_FLASH_BASE + CH32V003_FLASH_BOOT_MODEKEYP_OFFSET) /* write-only */
#define CH32V003_FLASH_BOOT_MODEKEYP_MODEKEYR (0xffffffff << 0) /* ffffffff: Boot mode key */
#define CH32V003_FLASH_BOOT_MODEKEYP_MODEKEYR_MASK (0xffffffff << 0)

